DavidBAV051/REMOTE_OMNI/REMOTE_CONTROL/ADC_FOR_Joysticks_lpadc_interrupt_cm33_core0/board/pin_mux.c
    const port_pin_config_t port1_9_pinB1_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as FC4_P1 */
                                                    kPORT_MuxAlt2,
                                                    /* Digital input enabled */
                                                    kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORT1_9 (pin B1) is configured as FC4_P1 */
    PORT_SetPinConfig(PORT1, 9U, &port1_9_pinB1_config);

    const port_pin_config_t port4_3_pinU12_config = {/* Internal pull-up/down resistor is disabled */
                                                      kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Pin is configured as ADC0_A2 */
                                                      kPORT_MuxAlt0,
                                                      /* Digital input disabled; it is required for analog functions */
                                                      kPORT_InputBufferDisable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT4_23 (pin U12) is configured as ADC0_A2 */
    PORT_SetPinConfig(PORT4, 3U, &port4_3_pinU12_config);
}

/* Add this function definition */
void LPSPI1_InitPins(void)
{
    CLOCK_EnableClock(kCLOCK_Port0);

    /* P0_24 - FC1_P0 (MOSI) */
    const port_pin_config_t port0_24_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable, kPORT_LowDriveStrength,
        kPORT_MuxAlt2, kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister
    };
    PORT_SetPinConfig(PORT0, 24U, &port0_24_config);

    /* P0_25 - FC1_P1 (SCK) */
    const port_pin_config_t port0_25_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable, kPORT_LowDriveStrength,
        kPORT_MuxAlt2, kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister
    };
    PORT_SetPinConfig(PORT0, 25U, &port0_25_config);

    /* P0_26 - FC1_P2 (MISO) */
    const port_pin_config_t port0_26_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable, kPORT_LowDriveStrength,
        kPORT_MuxAlt2, kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister
    };
    PORT_SetPinConfig(PORT0, 26U, &port0_26_config);

    /* P0_27 - FC1_P3 (CS) - OVERRIDES LED_GREEN CONFIGURATION */
    const port_pin_config_t port0_27_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable, kPORT_LowDriveStrength,
        kPORT_MuxAlt2, kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister
    };
    PORT_SetPinConfig(PORT0, 27U, &port0_27_config);
}


void ST7796_InitPins(void)
{
	CLOCK_EnableClock(kCLOCK_Port1);
	CLOCK_EnableClock(kCLOCK_Gpio1);
    CLOCK_EnableClock(kCLOCK_Port2);
    CLOCK_EnableClock(kCLOCK_Gpio2);


    /* P2_2: LCD_DC (GPIO Output) */
    const port_pin_config_t dc_config = {
        kPORT_PullDisable, kPORT_LowPullResistor, kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable, kPORT_LowDriveStrength,
        kPORT_MuxAlt0, /* GPIO */
        kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister
    };
    PORT_SetPinConfig(PORT2, 2U, &dc_config);

    /* P2_6: LCD_CS (GPIO Output) */
    PORT_SetPinConfig(PORT2, 6U, &dc_config);

    /* P2_7: LCD_RST (GPIO Output) */
    PORT_SetPinConfig(PORT2, 7U, &dc_config);

    /* P1_22: BL (GPIO Output) */
	PORT_SetPinConfig(PORT1, 22U, &dc_config);

    /* P2_3: LPSPI9_SCK (Alt 2) */
    const port_pin_config_t spi_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_FastSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable, kPORT_LowDriveStrength,
        kPORT_MuxAlt2, /* Flexcomm 9 */
        kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister
    };
    PORT_SetPinConfig(PORT2, 3U, &spi_config);

    /* P2_5: LPSPI9_SOUT/MOSI (Alt 2) */
    PORT_SetPinConfig(PORT2, 5U, &spi_config);

    /* P2_4: LPSPI9_SIN/MISO (Alt 2) - Optional if only writing */
    PORT_SetPinConfig(PORT2, 4U, &spi_config);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
